{"/articles/bayesian_statistics/posterior_predictive_checks_stan/":{"data":{"":"","#":"This post explains the why and how of posterior predictive checks, using R’s brms package.\nPosterior Predictive Checks Posterior predictive checks are usually graphical checks that the model gives predictions that more or less follow the original data. This isn’t a substitute for other model selection methods such as LOO-CV or information criterion and is usually done before those methods because it highlights major issues with a model.\nTo do them:\nFit a model of your choice. Generate predictions from the model, usually using the original data or using a test set (preferably both, if you have a decent sample size). Plot a graph to compare the original data to the predictions. In this case, I have used a density plot. How this is displayed will usually depend on the data, football scores tend to be quite low so the type of graph I have used doesn’t work as well. Judge how well the model fits the data based on the graph. Dataset I will use the quine data in the MASS package, which shows the number of days missed by school pupils in New South Wales, with ethnicity (aboriginal or not-aboriginal), sex (female or male), age (F0 for primary or forms F1, F2, F3), learner status (AL for average learner, SL for slow learner), and days absent.\n\u003e str(quine) 'data.frame':\t146 obs. of 5 variables: $ Eth : Factor w/ 2 levels \"A\",\"N\": 1 1 1 1 1 1 1 1 1 1 ... $ Sex : Factor w/ 2 levels \"F\",\"M\": 2 2 2 2 2 2 2 2 2 2 ... $ Age : Factor w/ 4 levels \"F0\",\"F1\",\"F2\",..: 1 1 1 1 1 1 1 1 2 2 ... $ Lrn : Factor w/ 2 levels \"AL\",\"SL\": 2 2 2 1 1 1 1 1 2 2 ... $ Days: int 2 11 14 5 5 13 20 22 6 6 ... I won’t show any graphs of the data (although I did plot them), but here is a table of the mean, variance, and their ratios for each group. Note that for the Poisson distribution (the obvious model for count data), the variance to mean ratio should be 1.\nquine %\u003e% group_by(Age, Eth, Lrn) %\u003e% summarise(mean = mean(Days), var = var(Days), ratio = var / mean, .groups = \"drop\") Age Eth Lrn Mean Var Ratio F0 A AL 16.7 169.0 10.1 F0 A SL 7.5 35.0 4.67 F0 N AL 10.6 100.0 9.48 F0 N SL 28.8 711.0 24.7 F1 A AL 11.1 32.8 2.94 F1 A SL 19.5 302.0 15.5 F1 N AL 9.12 69.3 7.59 F1 N SL 6.06 23.2 3.84 F2 A AL 24.2 266.0 11.0 F2 A SL 36.6 596.0 16.3 F2 N AL 8.12 85.3 10.5 F2 N SL 12.0 136.0 11.3 F3 A AL 20.1 202.0 10.1 F3 N AL 19.2 320.0 16.7 The number of days absent ranges from 0 to 81.\nPriors For all these models, I will use the default priors that brms gives for each model.\nGaussian Model The first model most people use is a Gaussian model, where the errors follow a Gaussian distribution. In brms:\nfit_gaussian \u003c- brm(Days ~ Sex + (1 | Age) + Eth + Lrn, family = gaussian(), data = quine) I haven’t displayed the model output to save space, but estimated errors were very, very high - possibly down to the vague priors, but let’s see how it compares to the original data.\npp_check(fit_gaussian) + theme_bw() + labs(title = \"Posterior Predictive Check for quine dataset\", subtitle = \"Gaussian Distribution\", x = \"Days Absent\", y = \"Density\") The solid line is the density plot of the actual data and the faded lines are density plots of some draws. These should follow the original data quite closely and it should only be possible to notice that the observed data are not from the draws because of the bold. There are a few issues with this plot.\nError 1: There are far too many negative values, which we know is not possible. A very small number (fractions of a percent) of predictions going outside the bounds might not be an issue, but clearly many here are (more than 16% of all predictions).\nError 2: The mode is in the wrong place. On the original data, it is at 5, but here is around 15 to 20. It might be acceptable to have a mode at 6, depending on how the rest of the distribution looks, but this is too much.\nThis is a poor fit for the observed data and there isn’t much good to say about the fit, so the Gaussian probably isn’t a good fit for these data.\nPoisson Model The most obvious model for count data is Poisson, which gives a model that looks like this.\nfit_poisson \u003c- brm(Days ~ Sex + (1 | Age) + Eth + Lrn, family = poisson(), data = quine) And a graphical posterior check looks like this:\npp_check(fit_poisson) + theme_bw() + labs(title = \"Posterior Predictive Check for quine dataset\", subtitle = \"Poisson Distribution\", x = \"Days Absent\", y = \"Density\") This is definitely better\nPositive 1: All values are non-negative, due to the constraint in the Poisson distribution.\nError 1: The mode of the predictions is around 12 or 13, compared to 5 for the actual data.\nError 2: The predictions only go up to around 45, but the actual data go all the way to 80.\nError 3: There is a large underestimate in low values (days absent \u003c 6 or 7) and a large overestimate from there up to around days absent = 30.\nThis is better than before, but still pretty rubbish.\nNegative-Binomial Model Finally, I will model it as a negative binomial distribution. This is a Poisson distribution with an overdispersion parameter, giving a higher variation than expected by the Poisson (brms does not allow the overdispersion parameter to vary with covariates).\nfit_neg_binom \u003c- brm(Days ~ Sex + (1 | Age) + Eth + Lrn, family = negbinomial(), data = quine) A graphical posterior predictive check looks like this:\npp_check(fit_neg_binom) + theme_bw() + labs(title = \"Posterior Predictive Check for quine dataset\", subtitle = \"Negative Binomial Distribution\", x = \"Days Absent\", y = \"Density\") Positive 1: The predictions are all non-negative, due to the constraint imposed by the negative-binomial distribution.\nPositive 2: The predictions clearly follow the dataset.\nPositive 3: The predictions are a similar density at the mode, with some draws over-estimating the density and some under-estimating the density.\nError 1: The days absent predictions go over 200, but the maximum in the original data is 81. Depending on what you are modelling, this may not be critical, and including other predictor variables or more informative priors should help.\nThis model is clearly a much better fit to the data, and unless there is an even better fitting distribution, we can use this for whatever we wanted the model for."},"title":"Posterior Predictive Checks"},"/articles/fedora/updating_to_new_version/":{"data":{"":"","#":"New versions of Fedora come out every six months (April and October). It is safest to upgrade one version at a time, e.g. from Fedora 40 to Fedora 41. Upgrading two versions at a time should also work but I have never tested it. Upgrading more than this is not recommended by Fedora so do it at your own risk.\nSeveral of these steps are unnecessary but I like to be extra careful and it should only take a couple of extra seconds.\nNote that you cannot downgrade in Fedora, once you upgrade (step 4), the only way back is to do a clean installation.\nStep 1 Reboot - not strictly necessary but I do it to be safe.\nStep 2 Update your packages, refresh your dnf system and reboot (warning: the last line will automatically and instantly reboot your PC). I usually refresh after installing everything just to be on the safe side. It has never found anything the second time (nor should it), but it only takes a couple of seconds to run.\nsudo dnf upgrade --refresh -y sudo dnf upgrade --refresh -y shutdown 0 -r Step 3 Install the upgrade package and download the updated packages. You should upgrade to the next version number.\nsudo dnf install dnf-plugin-system-upgrade sudo dnf system-upgrade download --releasever=41 Check that the upgrade will allow you to continue. It can sometimes refuse unless you add –allowerasing to the second part of the command. This will uninstall some packages, probably from third party repos. It won’t break your computer but may be useful. I usually wait until these have been resolved before upgrading.\nStep 4 Start upgrading. This will automatically reboot once or twice, without countdown or confirmation. When it is back, you will be on the new version.\nsudo dnf system-upgrade reboot Step 5 You are now on the new version, this step is optional and will clean up your system. Some packages are retired at each version, but won’t be removed. These packages won’t receive any updates but will still be on your system. You can also remove any packages which are duplicated or not in use.\nsudo dnf install remove-retired-packages -y remove-retired-packages sudo dnf remove --duplicates "},"title":"Updating Fedora"},"/articles/llms/":{"data":{"":"Articles about using LLMs."},"title":"LLMs"},"/articles/llms/advanced-prompting-tips/":{"data":{"":"","#":"This is about subtle changes you can make to your prompts to tune the output. These techniques allow me to get very high quality and consistent output from LLMs. There is no LLM output in this post, and some of these phrases can be tweaked to get different results. Not all of these phrases work exactly the same in every prompt or problem but a variation should work in most cases.\nTaking a Deep Breath and Going Step-by-Step This phrase, take a deep breath and go step-by-step, is one of the best ways to reduce hallucination and improve quality. LLMs are something of a black box, but this phrase encourages it to imitate someone who is thinking things through carefully.\nOnly Give the Model One Thing to Think About LLMs perform better if they only have to do one thing at a time. This comes up far more often than you might think - imagine you want it to write an RPG game for you. What are the steps you need to think about?\nWhen you designing the game you need to decide:\nDo you have a story or just battles? Are battles forced or can you opt out of them? Do you have one character or a party? Do you have weapons or magic? Do you pick your character’s name? Once you get past this, you have to think about programming it:\nWhat language to use Which libraries to use How to save data Which classes and objects do you have? Then when you get to programming it, you have to actually write code to program each part - movement, battles, character creation, saving. This is a lot to think about and LLMs struggle to scale.\nThe way to solve this is to have separate LLMs with different roles - one is a game design mentor who will guide you through the things you want to pick, the next will advise on language choice, the next will sketch out a map of the code, and one separate chat window will program each part.\nRepetition Repeating any key words in your prompt make the LLM give it more importance. Instead of using multiple words that mean the same thing, focus on one.\nCapitalisation Putting a key word in ALL CAPS also makes the LLM pick up on a word more and gives that more weight than others.\nBe Abrupt Saying please or asking if it will do something will affect the output - if you want to get long winded, rambling, output then saying please and thank you will encourage this. If you want the model to get to the point then don’t use them and give direct instructions.\nImagine the model is a misbehaving eight year old and needs a set of clear instructions, but be prepared for the possibility that it will ignore some of them just to annoy you.\nRewarding Telling the LLM it will get a reward if it follows some specific behaviour will encourage it to do better. You can use phrases like you will be rewarded if you give a creative answer or even offer it money you will receive a £20 tip if you give a creative answer. Offering more money can improve the output further.\nPenalising The flip side to rewards is if you want the LLM to avoid doing something, you can tell it it will be penalised if it does it. I have found that phrases like refrain from giving an introduction usually make it give longer introductions in 30-70% of cases, but phrases like you will be PENALIZED if you give an introduction deter it (capitalisation also helps here).\nCommon things I penalise are:\nYou will be PENALIZED if you write an introductory sentence You will be HEAVILY PENALIZED if your output exceeds x words You will be VERY HEAVILY PENALIZED if you hallucinate American English vs British English British English is not the most common version of English on the internet, which is where most of the training data come from. LLMs will tend to respond in American English, and tend to work slightly better if the input is in British English. This point isn’t critical unless you are trying to write a production quality prompt.\nForcing JSON Format LLMs are keen to write introductory sentences like “the output you requested is …” or variations of that. Adding a prompt element like output should be in JSON format will often discourage those introductory sentences. This one takes a bit of tuning to get right and different phrases will work with different prompts - sometimes it will introduce the JSON, sometimes it will put the sentence inside the JSON, and sometimes you need to define which keys you want.\nSpecifying a JSON Bin You may find that the output gives you some information you don’t need, like giving its opinion on the factual accuracy when you only asked for a summary of what was said. Specifying that any extra information goes into a separate key in a JSON string gives the LLM a safe place to put this information, which you can then discard.\nFew Shot Prompting Giving examples of the sort of output can really help. Imagine I asked you to give a plot summary of the Lord of the Rings - you might know the story well but you don’t necessarily know if you should give one short sentence saying a hobbit went on a long journey with a magic ring to destroy it in a volcano or a one or two page summary explaining where they went and what the ring was. So it is with LLMs. They do not know exactly what you are expecting or how they should classify things."},"title":"Advanced Prompting Tips"},"/cheat_sheets/":{"data":{"":"This section is for recording syntax. Most of it is basic, but easy to forget."},"title":"Cheat Sheets"},"/cheat_sheets/bash/fix_wifi_issues/":{"data":{"":"If you use nmcli and you cannot change to a new Wifi setup, deleting the WiFi connection and creating a new one will usually allow you to connect.\nFirst, delete the connection\nnmcli connection delete \"wifi_name\" Then, recreate the connection.\nThis version will ask you for the password and give you the option to enter it without it being visible.\nnmcli device wifi connect \"wifi_name\" -a This version will ask you for the password with it typed into the command.\nnmcli device wifi connect \"wifi_name\" \"wifi_password\" This version will let you save a uuid, if you know it and are not in range of the WiFi connection. Note that it also autoconnects.\nnmcli connection add \\ type wifi \\ con-name \"wifi_name_visible\" \\ ifname wlan0 \\ ssid \"wifi_ssid\" \\ wifi-sec.key-mgmt wpa-psk \\ wifi-sec.psk \"wifi_password\" \\ connection.uuid \"wifi_uuid\" \\ connection.autoconnect yes con-name is the name you see, this can be anything. wifi_ssid is the SSID, which is specific to the connection. "},"title":"Fix Wifi Connection"},"/cheat_sheets/python/loading_and_saving_data/":{"data":{"":"","#":"For files on S3, pandas works out of the box using S3 URI, which is in the format “s3://bucket_name/folder_name/file.csv” - this should be given as though it were a file name.\nCSV import pandas as pd df = pd.read_csv(\"/home/david/Documents/Temp/test.csv\") df.to_csv(\"/home/david/Documents/Temp/test.csv\", index = False) JSON import pandas as pd df = pd.read_json(\"/home/david/Documents/Temp/test.json\") df.to_json(\"/home/david/Documents/Temp/test.json\") Parquet import pandas as pd df = pd.read_parquet(\"/home/david/Documents/Temp/test.parquet\") df.to_parquet(\"/home/david/Documents/Temp/test.parquet\") Excel import pandas as pd df = pd.read_excel(\"/home/david/Documents/Temp/test.xlsx\") df.to_excel(\"/home/david/Documents/Temp/test.xlsx\", index = False) "},"title":"Loading and Saving Data in Python"},"/cheat_sheets/r/loading_and_saving_data/":{"data":{"":"","#":"Only the basic functionality is given - use ?function_name for details on loading specific parts. For reading CSV files, stringsAsFactors = FALSE will load as a character string, which can be helpful, albeit more expensive in memory.\nCSV # Base R df \u003c- read.csv(file = \"/home/david/Documents/Temp/test.csv\") write.csv(x = df, file = \"/home/david/Documents/Temp/test.csv\", row.names = FALSE) # Tidyverse library(readr) # or library(tidyverse) df \u003c- readr::read_csv(file = \"/home/david/Documents/Temp/test.csv\") readr::write_csv(x = df, file = \"/home/david/Documents/Temp/test.csv\") # data.table library(data.table) df \u003c- data.table:: fread(file = \"/home/david/Documents/Temp/test.csv\") data.table::fwrite(x = df, file = \"/home/david/Documents/Temp/test.csv\") JSON library(jsonlite) df \u003c- jsonlite::fromJSON(txt = \"/home/david/Documents/Temp/test.json\") jsonlite::write_json(x = df, json = \"/home/david/Documents/Temp/test.json\") Parquet library(arrow) df \u003c- arrow::read_parquet(file = \"/home/david/Documents/Temp/test.parquet\") arrow::write_parquet(x = df, file = \"/home/david/Documents/Temp/test.parquet\") Excel (xlsx) library(openxlsx) openxlsx::read.xlsx(xlsxFile = \"/home/david/Documents/Temp/test.xlsx\") openxlsx::write.xlsx(x = df, file = \"/home/david/Documents/Temp/test.xlsx\") Bulk Read This loads multiple files in one directory (can include subdirectories). Any function or file type can be used as long as the first input is the file name.\nlibrary(readbulk) readbulk::read_bulk( directory = \"/home/david/Documents/Test/\", extension = \".csv\", verbose = FALSE, fun = data.table::fread, data = df, # Add to an existing dataframe subdirectories = TRUE # FALSE to only include top level folder ) S3 R does not have basic S3 functionality so this function needs to be used.\nlibrary(aws.s3) aws.s3::s3read_using(FUN = fread, bucket = \"\", object = \"\") aws.s3::s3write_using(x = df, FUN = fwrite, bucket = \"\", object = \"\") "},"title":"Loading and Saving Data in R"},"/cheat_sheets/r/percentages_in_ggplot2/":{"data":{"":"Use this syntax to format as percentages:\nscale_x_continuous(labels = scales::percent_format())\nscale_y_continuous(labels = scales::percent_format())\nTo go to 1 decimal place, use:\nscale_x_continuous(labels = scales::percent_format(accuracy = 0.1))\nscale_y_continuous(labels = scales::percent_format(accuracy = 0.1))"},"title":"Percentages in ggplot2"},"/my_library/":{"data":{"":"This is a list of resources I like and recommend, grouped by topic."},"title":"Library"},"/my_library/cricket/":{"data":{"":"","#":"Live Cricket on YouTube Every match in the County Championship and Minor Counties Cricket Championship is available on the home county’s YouTube channel. Yorkshire Lincolnshire\nThe West Indies Championship is streamed on the Windies Cricket channel\nVideos The full last hour of Ben Stokes’ innings at Headingley in the 2019 Ashes YouTube\nThe Test Match Special commentary of the afternoon session of Ben Stokes’ innings at Headingley in the 2019 Ashes YouTube\nStephen Fry explains the laws of cricket Youtube\nBooks Better Cricket Stats Amazon - updated cricket metrics to be more realistic and gives rankings of players"},"title":"Cricket"},"/my_library/paleontology/":{"data":{"":"","#":"Podcasts and YouTube Paleonerds (Spotify) - a podcast by two amateur fossil collectors. Interviews with paleontologists and other scientists every month. Em Gems (YouTube) - a PhD geology student who talks about fossils. Books The Dinosaurs Rediscovered (Amazon) - a book about the latest understanding of dinosaurs and how they were discovered. "},"title":"Paleontology"},"/my_library/statistics/":{"data":{"":"","#":"Blogs StatModeling at Columbia. A blog by Andrew Gelman and other statisticians at Columbia and Stan developers. Most common topics are Stan and social science.\nStan Forums - Link\nBooks - Lay Audience The Art of Statistics, David Spiegelhalter (Amazon) - a good book for anyone who wants to be better at interpreting statistics and numbers in the news."},"title":"Statistics"},"/prompts/":{"data":{"":"This is my prompt library."},"title":"Prompts"},"/prompts/data_formatters/":{"data":{"":"The prompts in this page take data in a messy format, like tables on a website, and conver them into a tidier one - either JSON, YAML, or XML."},"title":"Data Formatters"},"/prompts/data_formatters/json_data_formatter/":{"data":{"":"This prompt will turn a messy table (such as a table copy and pasted from the front end of a website) into JSON format.\nIf the row or column names are not always in the same format in every table you copy you might need to specify the element names or exclude some rows or columns.\nA very large table may need multiple rows, in which case you can type “continue” and join the parts later.\nTask: Description: \"Convert a table into JSON format based on specified requirements.\" Rules: - \"The output JSON must include the elements []\" - \"Exclude the rows []\" - \"Exclude the columns []\" - \"Maintain the structure and data of the original table in the JSON output.\" Role: Description: \"Data Conversion Specialist\" Rules: - \"Expertise in transforming data between various formats, including tables and JSON.\" - \"Ability to understand and follow specific data conversion requirements.\" - \"Meticulous attention to detail to ensure accurate and complete data transformation.\" Audience: Description: \"Data Analysts and Developers\" Rules: - \"Familiar with working with structured data in tables and JSON format.\" - \"Require the data to be in a specific JSON structure for further processing or analysis.\" - \"Expect the converted data to be accurate, complete, and adhere to the specified requirements.\" Create: Description: \"JSON Data\" Rules: - \"Generate well-formatted JSON that adheres to the JSON specification.\" - \"Ensure the JSON structure matches the elements specified in the original prompt.\" - \"Exclude the specified rows and columns from the JSON output.\" Intent: Description: \"To convert a table into a JSON format that meets the specific requirements provided, enabling easier data processing, analysis, and integration with other systems.\" Rules: - \"Facilitate data exchange and interoperability between different systems or applications.\" - \"Provide data in a structured and machine-readable format for further manipulation and analysis.\" - \"Ensure the accuracy and completeness of the converted data while adhering to the specified requirements.\" The table: [Copy and paste table here] "},"title":"JSON"},"/prompts/data_formatters/xml_data_formatter/":{"data":{"":"This prompt will turn a messy table (such as a table copy and pasted from the front end of a website) into XML format.\nIf the row or column names are not always in the same format in every table you copy you might need to specify the element names or exclude some rows or columns.\nA very large table may need multiple rows, in which case you can type “continue” and join the parts later.\nTask: Description: \"Convert a table into XML format based on specified requirements.\" Rules: - \"The output XML must include the elements []\" - \"Exclude the rows []\" - \"Exclude the columns []\" - \"Maintain the structure and data of the original table in the XML output.\" Role: Description: \"Data Conversion Specialist\" Rules: - \"Expertise in transforming data between various formats, including tables and XML.\" - \"Ability to understand and follow specific data conversion requirements.\" - \"Meticulous attention to detail to ensure accurate and complete data transformation.\" Audience: Description: \"Data Analysts and Developers\" Rules: - \"Familiar with working with structured data in tables and XML format.\" - \"Require the data to be in a specific XML structure for further processing or analysis.\" - \"Expect the converted data to be accurate, complete, and adhere to the specified requirements.\" Create: Description: \"XML Data\" Rules: - \"Generate well-formatted XML that adheres to the XML specification.\" - \"Ensure the XML structure matches the elements specified in the original prompt.\" - \"Exclude the specified rows and columns from the XML output.\" Intent: Description: \"To convert a table into a XML format that meets the specific requirements provided, enabling easier data processing, analysis, and integration with other systems.\" Rules: - \"Facilitate data exchange and interoperability between different systems or applications.\" - \"Provide data in a structured and machine-readable format for further manipulation and analysis.\" - \"Ensure the accuracy and completeness of the converted data while adhering to the specified requirements.\" The table: [Copy and paste table here] "},"title":"XML"},"/prompts/data_formatters/yaml_data_formatter/":{"data":{"":"This prompt will turn a messy table (such as a table copy and pasted from the front end of a website) into YAML format.\nIf the row or column names are not always in the same format in every table you copy you might need to specify the element names or exclude some rows or columns.\nA very large table may need multiple rows, in which case you can type “continue” and join the parts later.\nTask: Description: \"Convert a table into YAML format based on specified requirements.\" Rules: - \"The output YAML must include the elements []\" - \"Exclude the rows []\" - \"Exclude the columns []\" - \"Maintain the structure and data of the original table in the YAML output.\" Role: Description: \"Data Conversion Specialist\" Rules: - \"Expertise in transforming data between various formats, including tables and YAML.\" - \"Ability to understand and follow specific data conversion requirements.\" - \"Meticulous attention to detail to ensure accurate and complete data transformation.\" Audience: Description: \"Data Analysts and Developers\" Rules: - \"Familiar with working with structured data in tables and YAML format.\" - \"Require the data to be in a specific YAML structure for further processing or analysis.\" - \"Expect the converted data to be accurate, complete, and adhere to the specified requirements.\" Create: Description: \"YAML Data\" Rules: - \"Generate well-formatted YAML that adheres to the YAML specification.\" - \"Ensure the YAML structure matches the elements specified in the original prompt.\" - \"Exclude the specified rows and columns from the YAML output.\" Intent: Description: \"To convert a table into a YAML format that meets the specific requirements provided, enabling easier data processing, analysis, and integration with other systems.\" Rules: - \"Facilitate data exchange and interoperability between different systems or applications.\" - \"Provide data in a structured and machine-readable format for further manipulation and analysis.\" - \"Ensure the accuracy and completeness of the converted data while adhering to the specified requirements.\" The table: [Copy and paste table here] "},"title":"YAML"},"/prompts/programming_assistants/":{"data":{"":"The prompts in this section will return usually correct code, but without explaining how it works. Best used when you can do it but can’t remember the syntax or are too lazy to type it all out."},"title":"Programming Assistants"},"/prompts/programming_assistants/bash/":{"data":{"":"This prompt will write bash code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. If it matters, you should specify your packages and distro underneath.\nTask: Description: \"Write bash code based on a given request.\" Rules: - \"Use correct bash functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert bash Programmer\" Rules: - \"Possess deep knowledge of bash programming language and its functions.\" - \"Able to write efficient, error-free bash code.\" - \"Stay up-to-date with the latest bash packages and best practices.\" - \"Has a detailed knowledge of Linux.\" Audience: Description: \"Bash/Linux Users\" Rules: - \"Familiar with bash programming language.\" - \"Looking for specific bash code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"Bash Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" Intent: Description: \"To provide functional bash code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver bash code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate bash functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"Bash"},"/prompts/programming_assistants/julia/":{"data":{"":"This prompt will write Julia code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. If it matters, you should specify your OS underneath.\nTask: Description: \"Write Julia code based on a given request.\" Rules: - \"Use correct Julia functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert Julia Programmer\" Rules: - \"Possess deep knowledge of R programming language and its functions.\" - \"Able to write efficient, error-free Julia code.\" - \"Stay up-to-date with the latest Julia packages and best practices.\" - \"Has a detailed knowledge of statistics and data science\" Audience: Description: \"Julia Users\" Rules: - \"Familiar with the Julia programming language.\" - \"Looking for specific Julia code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"Julia Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" Intent: Description: \"To provide functional Julia code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver Julia code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate R functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"Julia"},"/prompts/programming_assistants/python/":{"data":{"":"This prompt will write python code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. If it matters, you should specify your OS underneath.\nTask: Description: \"Write python code based on a given request.\" Rules: - \"Use correct python functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert python programmer\" Rules: - \"Possess deep knowledge of python programming language and its functions.\" - \"Able to write efficient, error-free python code.\" - \"Stay up-to-date with the latest python packages and best practices.\" Audience: Description: \"Python Users\" Rules: - \"Familiar with python programming language.\" - \"Looking for specific python code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"Python Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" - \"You MUST comply with PEP8 coding standards.\" Intent: Description: \"To provide functional python code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver python code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate ruby functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"Python"},"/prompts/programming_assistants/r/":{"data":{"":"This prompt will write R code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. If it matters, you should specify your OS underneath. This prompt is geared towards my preferences and you may wish to change some details.\nTask: Description: \"Write R code based on a given request.\" Rules: - \"Use correct R functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert R Programmer\" Rules: - \"Possess deep knowledge of R programming language and its functions.\" - \"Able to write efficient, error-free R code.\" - \"Stay up-to-date with the latest R packages and best practices.\" - \"Has a detailed knowledge of statistics and data science\" Audience: Description: \"R Users\" Rules: - \"Familiar with R programming language.\" - \"Looking for specific R code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"R Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" - \"Tidyverse and ggplot2 are preferred over Base R unless explicitly stated.\" - \"Use tab width 4\" - \"ggplot2 theme should be theme_bw\" - \"ggplot2 should use 'colour' rather than 'color'\" Intent: Description: \"To provide functional R code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver R code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate R functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"R"},"/prompts/programming_assistants/ruby/":{"data":{"":"This prompt will write ruby code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. If it matters, you should specify your gems and OS underneath.\nTask: Description: \"Write ruby code based on a given request.\" Rules: - \"Use correct ruby functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert ruby Programmer\" Rules: - \"Possess deep knowledge of ruby programming language and its functions.\" - \"Able to write efficient, error-free ruby code.\" - \"Stay up-to-date with the latest ruby packages and best practices.\" Audience: Description: \"Ruby Users\" Rules: - \"Familiar with ruby programming language.\" - \"Looking for specific ruby code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"Ruby Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" Intent: Description: \"To provide functional ruby code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver ruby code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate ruby functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"Ruby"},"/prompts/programming_assistants/sql/":{"data":{"":"This prompt will write SQL code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for small pieces of code, maybe a few lines long. You should specify your database system and schema/table structure.\nTask: Description: \"Write SQL code based on a given request.\" Rules: - \"Use correct SQL functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert SQL Programmer\" Rules: - \"Possess deep knowledge of SQL and its functions.\" - \"Able to write efficient, error-free SQL code.\" - \"Stay up-to-date with the latest SQL best practices.\" - \"Has a detailed knowledge of database systems and data engineering.\" Audience: Description: \"SQL Users\" Rules: - \"Familiar with SQL.\" - \"Looking for specific SQL code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"SQL Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" - \"Use tab width 4\" Intent: Description: \"To provide functional SQL code that accurately addresses the given request while adhering to the specified guidelines and best practices.\" Rules: - \"Deliver SQL code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate R functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"SQL"},"/prompts/programming_assistants/stan/":{"data":{"":"This prompt will write Stan code given a specific request, which goes at the bottom. The output will not explain anything or comment and is best used for relatively simple models or small changes to models.\nTask: Description: \"Write Stan code based on a given request.\" Rules: - \"Use correct Stan functions and syntax.\" - \"Avoid explaining or commenting the code.\" - \"Follow any specific approaches requested for all lines of code.\" - \"Provide the code in a code block.\" Role: Description: \"Expert Stan Programmer\" Rules: - \"Possess deep knowledge of Stan probabilistic programming language and its functions.\" - \"Able to write efficient, error-free, and fully functional Stan code.\" - \"Stay up-to-date with the latest Stan packages and best practices.\" - \"Has a detailed knowledge of Bayesian statistics and data science\" Audience: Description: \"Stan Users\" Rules: - \"Familiar with Stan programming language.\" - \"Familiar with Bayesian statistics.\" - \"Looking for specific Stan code solutions.\" - \"Value concise, correct, and functional code.\" Create: Description: \"Stan Code\" Rules: - \"Write the code in a code block.\" - \"You will be VERY SEVERELY PENALIZED if you use an incorrect function.\" - \"You will be VERY SEVERELY PENALIZED if you explain or comment your code.\" - \"If a specific package or approach has been requested, use that throughout.\" - \"Return the entire Stan file unless instructed otherwise.\" Intent: Description: \"To provide functional Stan code that accurately addresses the given request while adhering to the specified guidelines and programming best practices.\" Rules: - \"Deliver Stan code that directly solves the problem at hand.\" - \"Ensure the code is free of errors and uses the most appropriate Stan functions.\" - \"Present the code in a clear, concise manner without explanations or comments.\" Request: "},"title":"Stan"},"/prompts/prompt_generator/":{"data":{"":"This is my prompt generator. It will take a freeform (one-line) prompt and turn it into a much clearer TRACI prompt. You will get better output more quickly if you give it all the information up front, but it will infer what you meant. If you don’t say what your knowledge level is, it will usually assume you are a beginner. Follow up with a new prompt like now do \"explain tort law\", it will maintain the same quality of prompt.\nYour task: Create a TRACI format prompt from a freeform prompt. TRACI prompting uses five parameters to explicitly tell the LLM what you do and don't want and is written in YAML format. Fill in the gaps in the original prompt with what you think is sensible. Correct any factual errors as long as it doesn't change the meaning. I may be vague with what I want but you should make this more precise. About TRACI prompts: There are five elements to TRACI prompting: * Task: The general activity, explained at a high level * Role: The persona that the LLM should mimic * Audience: Who the output is for * Create: The format of the requested output (e.g. R code, SQL query, script for a presentation) * Intent: The goal that the text should fill Each of these have a description (high level) and rules (specific instructions). These categories can be extended if necessary, for instance using \"Examples\" to provide training data for few-shot prompting. Example of TRACI format: Task: Description: \"Write a summary explaining the differences between T20, ODI, and Test cricket formats to a non-cricketing audience.\" Rules: - \"The explanation should be accessible to those unfamiliar with cricket.\" - \"Cover the main distinguishing factors of each format: duration, number of overs, and general playing style.\" - \"Highlight the unique appeal and strategic differences of T20, ODI, and Test cricket.\" Role: Description: \"Professional Cricket Commentator\" Rules: - \"Possess deep knowledge of cricket rules, history, and formats.\" - \"Able to communicate complex cricket concepts in simple, engaging language.\" - \"Skilled in making cricket accessible and interesting to newcomers.\" Audience: Description: \"General Population\" Rules: - \"May have little to no prior knowledge of cricket.\" - \"Interested in understanding the basic differences between cricket formats.\" - \"Values clear, concise, and engaging explanations.\" Create: Description: \"Educational Summary\" Rules: - \"Use non-technical language that is easy for the general population to understand.\" - \"Incorporate examples or analogies to illustrate differences.\" - \"Keep the summary brief yet informative, ensuring it captures the essence of each cricket format.\" Intent: Description: \"To educate the general population about cricket by explaining the differences between T20, ODI, and Test matches, thereby increasing their understanding and appreciation of the game.\" Rules: - \"Enhance the audience's knowledge and interest in cricket.\" - \"Demystify cricket terminology and rules.\" - \"Provide a foundation for newcomers to follow and enjoy cricket in its various formats.\" My freeform prompt: \\*Enter prompt here\\* "},"title":"Prompt generator"}}